ananawaretrk/Opal_Fcc_nrf52810/fcc_jade_1/main.cpp
#include <stdbool.h>
#include <stdint.h>
#include <stdlib.h>
#include <stdio.h>

#include "nfc_t2t_lib.h"
#include "nordic_common.h"
#include "nrf.h"
#include "app_uart.h"
#include "app_fifo.h"
#include "nrf_error.h"
#include "nrfx_twim.h"
#include "nrf_drv_spi.h"
#include "nrfx_rtc.h"
#include "nrf_drv_clock.h"
#include "nrf_drv_timer.h"
#include "nrf_pwr_mgmt.h"
#include "nrfx_gpiote.h"
#include "nrf_gpio.h"
#include "nrf_soc.h"
#include "app_timer.h"
#include "fds.h"
#include "ble.h"
#include "nrf_sdm.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"
#include "ble_advdata.h"
#include "ble_nus.h"
#include "ble_conn_params.h"
#include "ble_conn_state.h"
#include "ble_conn_params.h"
#include "nrf_ble_qwr.h"
#include "nrf_ble_gatt.h"
#include "ble_advertising.h"
#include "peer_manager.h"
#include "nrfx_gpiote.h"
#include "nrf_drv_gpiote.h"
#include "nrf_delay.h"
#include "nrf_nvmc.h"
#include "nrf_uarte.h"
#include "arm_const_structs.h"
#include "RH_SX126x.h"
#include "RH_RF95.h"
#include "Wire.h"
#include "TMP117.h"
#include "i2c_wrapper.h"
#include "eventflag_and_errors.h"
#include "boards.h"
#include "nrf_drv_rng.h"
//#define temperature_sensor

// States
typedef enum {
  STATE_SOC_INIT,
  STATE_BOARD_INIT,
  STATE_GATT_SERVER,
  STATE_SLEEP,
  STATE_BLE_CONT_CW_TX,
  STATE_BLE_CONT_MCW_TX,
  STATE_BLE_CONT_RX,
  STATE_BLE_INT_CW_TX,
  STATE_BLE_INT_MCW_TX,
  STATE_BLE_INT_RX,
  STATE_BLE_INT_CW_TX_RX,
  STATE_BLE_INT_MCW_TX_RX,
  STATE_LORA_CONT_CW_TX,
  STATE_LORA_CONT_MCW_TX,
  STATE_LORA_CONT_RX,
  STATE_LORA_INT_CW_TX,
  STATE_LORA_INT_MCW_TX,
  STATE_LORA_INT_RX,
  STATE_LORA_RANDOM_FREQUENCY_HOPPING,
  STATE_LORA_FIXED_FREQUENCY_HOPPING,
  STATE_LORA_FIXED1_FREQUENCY_HOPPING,
  STATE_BLE_RANDOM_FREQUENCY_HOPPING,
  STATE_DEBUG
} sm_state;

sm_state state = STATE_SOC_INIT;
// -- States 

int lora_frequency_bandwidth = 0;
float lora_frequency_set [32] = {0};
float lora_frequency_set1 [52] = {0};

// Random number variable
uint8_t rand_number[3] = {0};
float f_random_number;
uint8_t random_byte;
uint8_t old_random_byte;
static uint8_t rng_num1();


//UART COLOR DEFINE
#define DBG_RED     "\x1b[31m"
#define DBG_GREEN   "\x1b[32m"
#define DBG_YELLOW  "\x1b[33m"
#define DBG_BLUE    "\x1b[34m"
#define DBG_MAGENTA "\x1b[35m"
#define DBG_CYAN    "\x1b[36m"
#define DBG_RESET   "\x1b[0m"
//#define test_print

// Sensor defines
#define I2C_SCL                  7 // Onyx i2c scl 7
#define I2C_SDA                  8 // Onyx i2c scl 8
#define I2C_PRIORITY             2
static TMP117  tmp_sensor = TMP117();
I2CWrapper i2c_wrapper(I2C_SDA,I2C_SCL,I2C_PRIORITY);
TwoWire Wire(i2c_wrapper.GetI2CInstance());
void print_temperature_sensor_data(void);

// LoRa defines
RH_RF95 rf95 = RH_RF95();

#define SPI_MISO_PIN    5
#define SPI_MOSI_PIN    3
#define SPI_SCK_PIN     4
#define LORA_NSS        2
#define LORA_RST        17
#define LORA_INT        6

uint8_t  buff[RH_RF95_MAX_MESSAGE_LEN];
char loraSendBuf[RH_RF95_MAX_MESSAGE_LEN];

// LoRa Function Prototypes
bool loraInit();
void init_spi_for_lora();
void lora_continuous_cw_transmit();
void lora_cw_transmit_5seconds();
void lora_continuous_transmit(bool flag);
void lora_continuous_receive();
void lora_interval_transmit(int localadvTime);
void lora_interval_transmit1(int localadvTime);
void lora_interval_receive(int scanDuration);
void lora_disable();

// Utility Function Prototypes
long power_map(long x, long in_min, long in_max, long out_min, long out_max);
long input_min = 0;
long input_max = 8;
long output_min = 5;
long output_max = 20;
int8_t loratxlevel = 0;
//float lorafrequency = 915.0f;
float lorafrequency = 915;
uint8_t bw_selection = 2; // 3=500Khz, 2=250Khz, 1=125Khz, 0=500Khz


#define UD_SER
#define CUT
#define PAR_CONFIG
//#define RESET
#define SAS //Scan,Adv,Sleep
//#define SLEEP

#define CLOCK_RESOULATION__ms     (1)

APP_TIMER_DEF(timer_id); //create a timer id
APP_TIMER_DEF(clock_id);

uint32_t millis_counter = 0;

void init_timer2(void);
void timer2_event_handler(void* p_context);

//#define LORA_INT        9
//#define LORA_RST        10
//#define LORA_NSS        4
//#define SPI_SCK_PIN     5
//#define SPI_MISO_PIN    11
//#define SPI_MOSI_PIN    NRF_GPIO_PIN_MAP(1,9)
#define ADXL375_SS_PIN  28
#define KX134_SS_PIN    2
#define SENSOR_PWR_PIN  3

#define SPI_INSTANCE  0
static const nrf_drv_spi_t spi = NRF_DRV_SPI_INSTANCE(SPI_INSTANCE);
volatile bool spi_xfer_done;
void spi_event_handler(nrf_drv_spi_evt_t const *p_event, void *p_context);

uint8_t lora_selected   = 0;
int8_t  lora_power      = 14;
float   lora_frequency  = 915.0f;

void lora_radio_enable(void);
void lora_radio_configure(void);
void lora_radio_cw_mode_w_data(void);
void lora_radio_cw_rx_mode(void);
void lora_radio_cw_mode(void);
void lora_radio_disable(void);

RH_SX126x sx126x = RH_SX126x();

void gpiote_lora_evt_handler(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action);

//Set this to 1 for scanner/advertise relay, 0 is normal cellular upload
#define ADV_SCANNER_FW 0
//Set this to 1 to disable TCA9535 code for green tape
#define TINY_RELAY 0

static char ackMessage[2] = "A";

//BLE SCANNING
int ADV_W = 250;     // uint millisecond
int8_t txlevel = 7;
int TX_POWER[9] = {-40,-30,-20,-16,-12,-8,-4,0,4};

uint8_t Ble_Scn_SIG[2] = {0x59, 0x00};
uint8_t Ble_Scn_SIG_ext[2] = {0x59, 0x00};
uint8_t Ble_Scn_Tab[2] = {0x0D, 0x18};
uint8_t Ble_Scn_UUID[2] = {0x49, 0x54}; // hex of IT(Infrastructure Tape)
uint8_t Ble_Scn_UUID_DEL[2] = {0xDE, 0x1E}; // hex of IT(Infrastructure Tape)
uint8_t Ble_Scn_OTA[2] = {0xDF, 0x00};
uint8_t Ble_Scn_UUID_out[2] = {0xCA, 0xF0};

enum EIR
{
    L0,
    T0,
    V0,
    L1,
    T1,
    SIGH,
    SIGL,
    U0,
    U1,
    U2,
    U3,
    U4,
    U5,
    U6,
    U7,
    U8,
    U9,
    U10,
    U11,
    U12,
    U13,
    U14,
    U15,
}; // BLE EIR Enum

bool clearFlag = true;
uint8_t records = 0;
bool TapeConfig = true;
bool BLE_GW = false;
bool Drop_Flag = false;
bool B_gps = false;
bool B_lora = false;
bool B_cell = false;
bool Tape_Type = false;
uint8_t Accl_TH = 1;
bool connected;
float hrsbuff[20];
bool cut_flag = false;
bool reset_flag = false;
bool debugMode = false;
bool findtapeFlag = false;

#ifdef UD_SER
#define APP_BLE_CONN_CFG_TAG             1                                          /**< A tag identifying the SoftDevice BLE configuration. */
#define DEVICE_NAME                      "CONFIG_DUT"                               /**< Name of device. Will be included in the advertising data. */
#define NUS_SERVICE_UUID_TYPE            BLE_UUID_TYPE_VENDOR_BEGIN                 /**< UUID type for the Nordic UART Service (vendor specific). */
#define APP_BLE_OBSERVER_PRIO            3                                          /**< Application's BLE observer priority. You shouldn't need to modify this value. */
#define APP_ADV_INTERVAL                 64                                         /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */
#define APP_ADV_DURATION                 18000                                      /**< The advertising duration (180 seconds) in units of 10 milliseconds. */
#define MIN_CONN_INTERVAL                MSEC_TO_UNITS(20, UNIT_1_25_MS)            /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL                MSEC_TO_UNITS(75, UNIT_1_25_MS)            /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                    0                                          /**< Slave latency. */
#define CONN_SUP_TIMEOUT                 MSEC_TO_UNITS(4000, UNIT_10_MS)            /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000)                      /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY    APP_TIMER_TICKS(30000)                     /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT     3                                          /**< Number of attempts before giving up the connection parameter negotiation. */
#define DEAD_BEEF                        0xDEADBEEF                                 /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */
#define UART_TX_BUF_SIZE                 256                                        /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE                 256                                        /**< UART RX buffer size. */
BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);                                   /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */
static uint16_t     m_conn_handle          = BLE_CONN_HANDLE_INVALID;               /**< Handle of the current connection. */
static uint16_t     m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;          /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */

static ble_uuid_t m_adv_uuids[]            =                                        /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};
#endif //UD_SER

#define APP_BLE_OBSERVER_PRIO 3                                                     //Application's BLE observer priority. You shouldn't need to modify this value.

