ananawaretrk/Opal_Fcc_nrf52810/fcc_jade_1/main.cpp
                records = (records + 1) % NUMBER_OF_TAGS;

            }
        }
    }

    scan_start();
    return;
}

void ble_scanner_evt_handler(ble_evt_t const *p_ble_evt, void *p_context)
{
    ble_gap_evt_t const *p_gap_evt = &p_ble_evt->evt.gap_evt;

    if (p_ble_evt->header.evt_id == BLE_GAP_EVT_ADV_REPORT)
    {
        on_adv_report(&p_gap_evt->params.adv_report);
    }
}

void ble_scanner_stack_init(void)
{
    uint32_t ram_start = 0;
    uint32_t error_code;

    error_code = nrf_sdh_enable_request();
    error_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    error_code = nrf_sdh_ble_enable(&ram_start);
}


void timer_event_handler(void *p_context)
{
#ifdef TEST
    printf("app timeout\n");
#endif //TEST
    timerFlag = 1;
    if (sleepflag == 1)
    {
        if (noSendCounter <= 0)
        {
            timeoutFlagb = 1;
            sleepflag = 0;

#ifdef MULTIPLE_SCAN_PER_SEND
            if (LoggingCount >= NumberOfLogsPerSend)
            {
                LoggingCount = 0;
                sendFlag = true;
            }
            else
            {
                LoggingCount++;
            }
#else // MULTIPLE_SCAN_PER_SEND
            sendFlag = true;
#endif // MULTIPLE_SCAN_PER_SEND
        }
        else
        {
            start_timer(1000 * timeroutPeriod);
            noSendCounter--;
            printf("skipped sending %d\n", noSendCounter);
            sendFlag = false;
        }
    }
}

void start_timer(int32_t miliTimeout)
{
    //We have 10 timer instances we can use, we only use 1, this re-creates it each time
    app_timer_create(&timer_id, APP_TIMER_MODE_SINGLE_SHOT, timer_event_handler); // can also use the single shot mode
    app_timer_start(timer_id, APP_TIMER_TICKS(miliTimeout), NULL);                                //e.g. for 2000 ms
    timerFlag = 0;
}

void init_timer2(void)
{
    app_timer_create(&clock_id, APP_TIMER_MODE_REPEATED, timer2_event_handler);
    app_timer_start(clock_id, APP_TIMER_TICKS(CLOCK_RESOULATION__ms), NULL);
}

void advertising_init(void)
{
    uint32_t err_code;
    ble_advdata_t advdata;
    uint8_t flags = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;
    ble_advdata_manuf_data_t manuf_specific_data;

#if ADV_SCANNER_FW == 1
    manuf_specific_data.company_identifier = APP_COMPANY_IDENTIFIER_EXT;
#else
    manuf_specific_data.company_identifier = APP_COMPANY_IDENTIFIER;
#endif
    manuf_specific_data.data.p_data = (uint8_t *)m_beacon_info;
    manuf_specific_data.data.size = APP_BEACON_INFO_LENGTH;

    // Build and set advertising data.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type = BLE_ADVDATA_NO_NAME;
    advdata.flags = flags;
    advdata.p_manuf_specific_data = &manuf_specific_data;

    // Initialize advertising parameters (used when starting advertising).
    memset(&m_adv_params, 0, sizeof(m_adv_params));

    m_adv_params.properties.type = BLE_GAP_ADV_TYPE_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED;
    m_adv_params.p_peer_addr = NULL; // Undirected advertisement.
    m_adv_params.filter_policy = BLE_GAP_ADV_FP_ANY;
    m_adv_params.interval = NON_CONNECTABLE_ADV_INTERVAL;
    m_adv_params.duration = 0; // Never time out.

    ble_advdata_encode(&advdata, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
    sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &m_adv_params);
}

void advertising_start(void)
{
    sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
}

void advertising_stop(void)
{
    sd_ble_gap_adv_stop(m_adv_handle);
}

void ble_adv_stack_init(void)
{
    uint32_t ram_start = 0;
    uint32_t ret;

    ret = nrf_sdh_enable_request();
    //printf("req ret = %x\n", ret);
    nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    //printf("ram address    = %x\n", ram_start);
    ret = nrf_sdh_ble_enable(&ram_start);
    //printf("en ret = %x\n", ret);
}

void ble_adv_init(void)
{
    ble_adv_stack_init();
    advertising_init();
    advertising_start();
}

void ble_scanner_init(void)
{
    ble_scanner_stack_init();
    scan_start();
}

void datasend()
{
    memset(data_array,0,sizeof(data_array));
    data_array[0] = 'A';
    data_array[1] = 'C';
    data_array[2] = 'K';
    data_array[3] = '1';
    ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);
    printf("Notified with ACK\n");
}

#ifdef UD_SER
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    printf("Softdevice asserted!\n");
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

void nus_data_handler(ble_nus_evt_t * p_evt)
{
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;
        printf("\nReceived data (%d bytes) from BLE NUS: ",p_evt->params.rx_data.length);
        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            printf("%02X:",p_evt->params.rx_data.p_data[i]);
        }
        printf("\n");
        
        // Byte-2
        if(p_evt->params.rx_data.p_data[2] == 1)
        {
            OTA = true;

            NRF_POWER->GPREGRET = 0xB1;
            nrf_delay_ms(100);
            NVIC_SystemReset();
        }
        
        // Byte-4
        lora_selected = p_evt->params.rx_data.p_data[4];
        
        // Byte-6
        advTime = (int)((int)(p_evt->params.rx_data.p_data[6])*1000);
        
        // Byte-7
        txlevel = p_evt->params.rx_data.p_data[7];

        // Byte-8
        scanDuration = (int)((int)(p_evt->params.rx_data.p_data[8])*1000);

        // Byte-9
        sleepTime = (int)((int)(p_evt->params.rx_data.p_data[9])*1000);

        // Byte-10
        MODE = p_evt->params.rx_data.p_data[10];

        // Byte-11 to 14
        int j = 0;
        unsigned char received_frequency[4];
        float my_frequency;
        for (int i = 11; i < 15; i++)
        {
            received_frequency[j++] = (p_evt->params.rx_data.p_data[i]);
        }
        memcpy(&my_frequency, &received_frequency, sizeof(my_frequency));
        ble_channel = (int)my_frequency;
        channel = (float)my_frequency;

        // Byte-15
        short_advTime = (int)((int)(p_evt->params.rx_data.p_data[15]));
        if(short_advTime == 99){
        advTime = 300;
        }
        else{
        advTime = (int)((int)(p_evt->params.rx_data.p_data[6])*1000);
        }

