ananawaretrk/Opal_Fcc_nrf52810/fcc_jade_1/main.cpp
        // Byte-16
        lora_frequency_bandwidth = (int)(p_evt->params.rx_data.p_data[16]);
        
        datasend();
    }
}

void gap_params_init(void)
{
    ble_gap_conn_params_t     gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    sd_ble_gap_device_name_set(&sec_mode,(const uint8_t *)DEVICE_NAME,strlen(DEVICE_NAME));

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency         = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout    = CONN_SUP_TIMEOUT;

    sd_ble_gap_ppcp_set(&gap_conn_params);
}


void services_init(void)
{
    ble_nus_init_t         nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};
    // Initialize Queued Write Module.
    qwr_init.error_handler = NULL;

    nrf_ble_qwr_init(&m_qwr, &qwr_init);
    // Initialize NUS.
    memset(&nus_init, 0, sizeof(nus_init));
    nus_init.data_handler = nus_data_handler;
    ble_nus_init(&m_nus,&nus_init);
}


void conn_params_evt_handler(ble_conn_params_evt_t * p_evt)
{
    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
    }
}

void conn_params_init(void)
{
    ble_conn_params_init_t cp_init;
    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = conn_params_evt_handler;
    cp_init.error_handler                  = NULL;
    ble_conn_params_init(&cp_init);
}

void ble_ud_stack_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
#ifdef TEST
            printf("Connected.\n");
#endif
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            connected = true;
            break;

    case BLE_GAP_EVT_DISCONNECTED:
#ifdef TEST
            printf("Disconnected, reason %d.\n",p_ble_evt->evt.gap_evt.params.disconnected.reason);
#endif
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
            connected = false;
            timerFlag = 1;
            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
#ifdef TEST
            printf("PHY update request.\n");
#endif
            ble_gap_phys_t phys;
            phys.rx_phys = BLE_GAP_PHY_AUTO;
            phys.tx_phys = BLE_GAP_PHY_AUTO;
            sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
        break;

        case BLE_GATTC_EVT_TIMEOUT:
#ifdef TEST
            printf("GATT Client Timeout.\n");
#endif
            sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
#ifdef TEST
            printf("GATT Server Timeout.\n");
#endif
            sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            break;

        default:
            break;
    }
}

void scan_start(void)
{
    (void)sd_ble_gap_scan_stop();
    sd_ble_gap_scan_start(&m_scan_params, &m_scan_buffer);
}


void ble_ud_stack_init(void)
{
    uint32_t err_code;

    nrf_sdh_enable_request();
    uint32_t ram_start = 0;

    if (nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start) != NRF_SUCCESS)
        printf("ud fail\n");

    // Enable BLE stack.
    if (nrf_sdh_ble_enable(&ram_start) != NRF_SUCCESS)
    {
        printf("ud memory fail\n");
    }

    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_ud_stack_evt_handler, NULL);
}

void ud_advertising_init(void)
{
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type                    = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags                            = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;     // BLE_GAP_ADV_FLAG_LE_GENERAL_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids    = m_adv_uuids;

    init.config.ble_adv_fast_enabled    = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout    = APP_ADV_DURATION;
    init.evt_handler = NULL;
    ble_advertising_init(&m_advertising, &init);
    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);

}

void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
    if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
    {
        m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
        printf("Data len is set to 0x%X(%d)\n", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
    }

    printf("ATT MTU exchange completed. central 0x%x peripheral 0x%x\n",
                                p_gatt->att_mtu_desired_central,
                                p_gatt->att_mtu_desired_periph);
}


void gatt_init(void)
{
    nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
}

void ud_advertising_start(void)
{
    ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
}
#endif //UD_SER


void ud_init(void)
{
#ifdef UD_SER
    ble_ud_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    ud_advertising_init();
    conn_params_init();
#ifdef TEST
    printf("UD_Init...Done...!\n");
#endif
    //application_timers_start();
    ud_advertising_start();
    connected = false;
    printf("UD_Start...!\n");
#endif //UD_SER
}

