ananawaretrk/Opal_Fcc_nrf52810/fcc_jade_1/main.cpp
void sel_txpower(int tx_level)
{
    switch(tx_level)
    {
        case 0:
            txpower = RADIO_TXPOWER_TXPOWER_Neg40dBm; /**< Radio output power. */
        break;

        case 1:
            txpower = RADIO_TXPOWER_TXPOWER_Neg30dBm; /**< Radio output power. */
        break;

        case 2:
            txpower = RADIO_TXPOWER_TXPOWER_Neg20dBm; /**< Radio output power. */
        break;

        case 3:
            txpower = RADIO_TXPOWER_TXPOWER_Neg16dBm; /**< Radio output power. */
        break;

        case 4:
            txpower = RADIO_TXPOWER_TXPOWER_Neg12dBm; /**< Radio output power. */
        break;

        case 5:
            txpower = RADIO_TXPOWER_TXPOWER_Neg8dBm; /**< Radio output power. */
        break;

        case 6:
            txpower = RADIO_TXPOWER_TXPOWER_Neg4dBm; /**< Radio output power. */
        break;

        case 7:
            txpower = RADIO_TXPOWER_TXPOWER_0dBm; /**< Radio output power. */
        break;

        case 8:
            txpower = RADIO_TXPOWER_TXPOWER_Pos4dBm; /**< Radio output power. */
        break;

        default:
            txpower = RADIO_TXPOWER_TXPOWER_0dBm; /**< Radio output power. */
        break;
    }
}

void radio_disable(void)
{
    NRF_RADIO->SHORTS = 0;
    NRF_RADIO->EVENTS_DISABLED = 0;
    NRF_RADIO->TASKS_TXEN = 0;
    NRF_RADIO->TASKS_STOP = 1;
    NRF_RADIO->TASKS_DISABLE = 1;
    NRF_RADIO->EVENTS_END = 1U;

    while (NRF_RADIO->EVENTS_DISABLED == 0)
    {
            // Do nothing.
    }
    NRF_RADIO->EVENTS_DISABLED = 0;
}

void radio_config(void)
{
    NRF_RADIO->POWER = 1;
    NRF_RADIO->SHORTS    = RADIO_SHORTS_READY_START_Msk;
    sel_txpower(txlevel);
    NRF_RADIO->TXPOWER = (txpower << RADIO_TXPOWER_TXPOWER_Pos);
    NRF_RADIO->MODE        = (mode << RADIO_MODE_MODE_Pos);
    NRF_RADIO->FREQUENCY = ble_channel;
    NRF_RADIO->TASKS_TXEN = 1;
}


void modulation(void)
{
    mode = RADIO_MODE_MODE_Ble_2Mbit;

    // Reset Radio ramp-up time.
    NRF_RADIO->MODECNF0 &= (~RADIO_MODECNF0_RU_Msk);

    // Packet configuration:
    // Bit 25: 1 Whitening enabled
    // Bit 24: 1 Big endian,
    // 4-byte base address length (5-byte full address length),
    // 0-byte static length, max 255-byte payload.
    NRF_RADIO->PCNF1 = (RADIO_PCNF1_WHITEEN_Enabled << RADIO_PCNF1_WHITEEN_Pos) |
                      (RADIO_PCNF1_ENDIAN_Big << RADIO_PCNF1_ENDIAN_Pos) |
                      (4UL << RADIO_PCNF1_BALEN_Pos) |
                      (0UL << RADIO_PCNF1_STATLEN_Pos) |
                      ((sizeof(m_tx_packet) - 1) << RADIO_PCNF1_MAXLEN_Pos);
    NRF_RADIO->CRCCNF = (RADIO_CRCCNF_LEN_Disabled << RADIO_CRCCNF_LEN_Pos);

    // Set the device address 0 to use when transmitting
    NRF_RADIO->TXADDRESS   = 0x00UL;
    // Enable the device address 0 to use to select which addresses to receive
    NRF_RADIO->RXADDRESSES = 0x01UL;

    //TRANSMIT_PATTERN_11001100:
    NRF_RADIO->PREFIX0 = 0xCC;
    NRF_RADIO->BASE0     = 0xCCCCCCCC;

    NRF_RADIO->PCNF0 = (0UL << RADIO_PCNF0_S1LEN_Pos) |
                       (0UL << RADIO_PCNF0_S0LEN_Pos) |
                       (RADIO_PCNF0_PLEN_16bit << RADIO_PCNF0_PLEN_Pos) |
                       (RADIO_LENGTH_LENGTH_FIELD << RADIO_PCNF0_LFLEN_Pos);

    m_tx_packet[0] = sizeof(m_tx_packet) - 1;

    // Fill payload with random data.
    for (uint8_t i = 0; i < sizeof(m_tx_packet) - 1; i++)
    {
          m_tx_packet[i + 1] = 0xCC;
    }

    NRF_RADIO->PACKETPTR = (uint32_t)m_tx_packet;

    NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_END_START_Msk;

    sel_txpower(txlevel);
    NRF_RADIO->TXPOWER    = (txpower << RADIO_TXPOWER_TXPOWER_Pos);
    NRF_RADIO->MODE       = (mode << RADIO_MODE_MODE_Pos);
    NRF_RADIO->FREQUENCY  = ble_channel;
    NRF_RADIO->EVENTS_END = 0U;
    NRF_RADIO->TASKS_TXEN = 1;

    while (NRF_RADIO->EVENTS_END == 0U)
    {
        // wait
    }
}

void radio_rx()
{
    NRF_RADIO->MODE      = (mode << RADIO_MODE_MODE_Pos);
    NRF_RADIO->SHORTS    = RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_END_START_Msk;
    NRF_RADIO->PACKETPTR = (uint32_t)g_rx_packet;

    // Reset Radio ramp-up time.
    NRF_RADIO->MODECNF0 &= (~RADIO_MODECNF0_RU_Msk);

    // Packet configuration:
    // Bit 25: 1 Whitening enabled
    // Bit 24: 1 Big endian,
    // 4-byte base address length (5-byte full address length),
    // 0-byte static length, max 255-byte payload .
    NRF_RADIO->PCNF1 = (RADIO_PCNF1_WHITEEN_Enabled << RADIO_PCNF1_WHITEEN_Pos) |
                       (RADIO_PCNF1_ENDIAN_Big << RADIO_PCNF1_ENDIAN_Pos) |
                       (4UL << RADIO_PCNF1_BALEN_Pos) |
                       (0UL << RADIO_PCNF1_STATLEN_Pos) |
                       ((sizeof(m_tx_packet) - 1) << RADIO_PCNF1_MAXLEN_Pos);
    NRF_RADIO->CRCCNF = (RADIO_CRCCNF_LEN_Disabled << RADIO_CRCCNF_LEN_Pos);

    NRF_RADIO->TXADDRESS   = 0x00UL; // Set the device address 0 to use when transmitting
    NRF_RADIO->RXADDRESSES = 0x01UL; // Enable the device address 0 to use to select which addresses to receive
    NRF_RADIO->PREFIX0 = 0xCC;
    NRF_RADIO->BASE0   = 0xCCCCCCCC;


    // Packet configuration:
    // S1 size = 0 bits, S0 size = 0 bytes, payload length size = 8 bits, 16-bit preamble.
    NRF_RADIO->PCNF0 =  (0UL << RADIO_PCNF0_S1LEN_Pos) |
                        (0UL << RADIO_PCNF0_S0LEN_Pos) |
                        (RADIO_PCNF0_PLEN_16bit << RADIO_PCNF0_PLEN_Pos) |
                        (RADIO_LENGTH_LENGTH_FIELD << RADIO_PCNF0_LFLEN_Pos);

    NRF_RADIO->FREQUENCY = ble_channel;
    NRF_RADIO->TASKS_RXEN = 1U;
}

void prepare_sleep()
{
    nrf_sdh_disable_request();
}

void prepare_wake()
{
}

void tapeDiagnosis(void)
{
    prepare_sleep();
    prepare_wake();
    NRF_RNG->TASKS_START = 1;
    NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
    NRF_CLOCK->TASKS_HFCLKSTART        = 1;

    while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0){ } // Do nothing.
    
    // LoRa
    if(lora_selected)
    {
        printf(DBG_GREEN "LoRa Radio Selected\n" DBG_RESET);
        loraInit();
        nrf_delay_ms(1000);
        //rf95.setFrequency(920);
    }
    
    // BLE
    else
    {
        printf(DBG_BLUE "BLE Radio Selected\n" DBG_RESET);
        radio_disable();
    }

    if(debugMode) // TRUE -> interval
    {
        while(1)
        {   
            // LoRa - enabled and transmit
            if(lora_selected && advTime > 0)
            {
                printf(DBG_GREEN "LoRa Radio Transmit\n" DBG_RESET);
                lora_continuous_cw_transmit();
            }
            
            // BLE - enabled and transmit
            else if(!lora_selected && advTime > 0)
            {
                printf(DBG_BLUE "BLE Radio Transmit\n" DBG_RESET);
                radio_config();
            }
            
            // LoRa/BLE Advertise time
            if(advTime > 0)
            {
            start_timer(advTime);

            while(!timerFlag)
            {
                nrf_pwr_mgmt_run();
            }

            stop_timer();
          }
            
            // LoRa - disable
            if(lora_selected)
            {
                #ifdef test_print
                printf(DBG_GREEN "LoRa Radio Disabled\n" DBG_RESET);
                #endif //test_print
                lora_disable();
            }
            // BLE - disable
            else if (!lora_selected)
            {
                #ifdef test_print
                printf(DBG_BLUE "BLE Radio Disabled\n" DBG_RESET);
                #endif //test_print
                radio_disable();
            }
            
            // LoRa/BLE sleep time
            if (sleepTime != 0)
            {
                printf(DBG_YELLOW "BLE/LoRa Radio Sleep\n" DBG_RESET);
                start_timer(sleepTime);

                while (!timerFlag)
                {
                    nrf_pwr_mgmt_run();
                }
            }
            
            // LoRa - enabled and receive
            if (lora_selected && scanDuration >0)
            {
                printf(DBG_GREEN "LoRa Interval Radio receive\n" DBG_RESET);
                printf(DBG_MAGENTA "-------scanDuration: %d\n" DBG_RESET, scanDuration);
                lora_interval_receive(scanDuration);
            }
              
            // BLE - enabled and receive
            else if (!lora_selected && scanDuration >0)
            {
                printf(DBG_BLUE "BLE Radio Scan\n" DBG_RESET);
                
                bleScan(scanDuration);
//                radio_rx();
//                start_timer(scanDuration);
//
//                while (!timerFlag)
//                {
//                    nrf_pwr_mgmt_run();
//                }
//
//                stop_timer();
            }

            if(scanDuration > 0 && advTime == 0 && sleepTime == 0)
            {
              printf("Do not measure temperature\n");
            }
            else {
             #ifdef temperature_sensor
            print_temperature_sensor_data();
            #endif
            }
        }
    }
    else
    {
        if (lora_selected)
        {
            printf(DBG_GREEN "LoRa Radio Transmit\n" DBG_RESET);
            lora_continuous_cw_transmit();
        }
        else
        {
            printf(DBG_BLUE "BLE Radio Transmit\n" DBG_RESET);
            radio_config();  
        }

        while(1)
        {
            nrf_pwr_mgmt_run();
            #ifdef temperature_sensor
            print_temperature_sensor_data();
            #endif
            nrf_delay_ms(1000);
        }
    }
}

void radio_with_data1(bool flag)
{
    prepare_sleep();
    prepare_wake();
    NRF_RNG->TASKS_START = 1;
    NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
    NRF_CLOCK->TASKS_HFCLKSTART        = 1;

    while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0){ } // Do nothing.
    
