ananawaretrk/Opal_Fcc_nrf52810/fcc_jade_1/main.cpp
    // LoRa
    if(lora_selected)
    {
        printf(DBG_GREEN "LoRa Radio Selected\n" DBG_RESET);
        loraInit();
        nrf_delay_ms(1000);
        //rf95.setFrequency(920);
    }
    
    // BLE
    else
    {
        printf(DBG_BLUE "BLE Radio Selected\n" DBG_RESET);
        radio_disable();
    }

    if(flag) // TRUE -> interval
    {
        while(1)
        {   
            // LoRa - enabled and transmit
            if(lora_selected && advTime > 0)
            {
                printf(DBG_GREEN "LoRa Radio Transmit\n" DBG_RESET);
                lora_interval_transmit1(advTime);
            }
            
            // BLE - enabled and transmit
            else if (!lora_selected && advTime > 0)
            {
                printf(DBG_BLUE "BLE Radio Transmit\n" DBG_RESET);
                modulation();
            }
            
            // LoRa/BLE Advertise time
            if(!lora_selected && advTime > 0)
            {
              start_timer(advTime);

              while(!timerFlag)
              {
                  nrf_pwr_mgmt_run();
              }

              stop_timer();
            }
            
            // LoRa - disable
            if(lora_selected)
            {
                #ifdef test_print
                printf(DBG_GREEN "LoRa Radio Disabled\n" DBG_RESET);
                #endif //test_print
                lora_disable();
            }
            // BLE - disable
            else if (!lora_selected)
            {
                #ifdef test_print
                printf(DBG_BLUE "BLE Radio Disabled\n" DBG_RESET);
                #endif //test_print
                radio_disable();
            }
            
            // LoRa/BLE sleep time
            if (sleepTime != 0)
            {
                printf(DBG_YELLOW "BLE/LoRa Radio Sleep\n" DBG_RESET);
                start_timer(sleepTime);

                while (!timerFlag)
                {
                    nrf_pwr_mgmt_run();
                }
            }
            
            // LoRa - enabled and receive
            if (lora_selected && scanDuration >0)
            {
                printf(DBG_GREEN "LoRa Interval Radio receive\n" DBG_RESET);
                printf(DBG_MAGENTA "-------scanDuration: %d\n" DBG_RESET, scanDuration);
                lora_interval_receive(scanDuration);
            }
              
            // BLE - enabled and receive
            else if(!lora_selected && scanDuration >0)
            {
                printf(DBG_BLUE "BLE Radio Scan\n" DBG_RESET);
                
                bleScan(scanDuration);
//                radio_rx();
//                start_timer(scanDuration);
//
//                while (!timerFlag)
//                {
//                    nrf_pwr_mgmt_run();
//                }
//
//                stop_timer();
            }
            if (scanDuration > 0 && advTime == 0 && sleepTime == 0) {
              printf("Do not measure temperature\n");
            } else {
            #ifdef temperature_sensor
            print_temperature_sensor_data();
            #endif
            }
        }
            
    }
    else
    {
        if (lora_selected)
        {
            printf(DBG_GREEN "LoRa Radio Transmit\n" DBG_RESET);
            lora_continuous_transmit(true);
        }
        else
        {
            printf(DBG_BLUE "BLE Radio Transmit\n" DBG_RESET);
            modulation();   
        }

        while(1)
        {
            nrf_pwr_mgmt_run();
            #ifdef temperature_sensor
            print_temperature_sensor_data();
            #endif
            nrf_delay_ms(1000);
        }
    }
}



void bufferclearTape(void)
{
#ifdef RESET
    if(!reset_flag)
    {
        advertising_stop();
        memset(m_beacon_info,0,sizeof(m_beacon_info));
        m_beacon_info[0] = 0xDE; //I
        m_beacon_info[1] = 0x1E; //T
        m_beacon_info[2] = rssiTH; //T

        m_beacon_info[3] = (uint8_t)(adcToBat(adcResult[3])*100);
        printf("RssiTH:%02X, BattV:%02X\n",m_beacon_info[2],m_beacon_info[3]);
        advertising_init();
        sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV,NULL,TX_POWER[txlevel]);
        advertising_start();
        random_pwr_fix();
        start_timer(battTime);

        while(!timerFlag && !reset_flag)
        {
            nrf_pwr_mgmt_run();
        }

        stop_timer();
    }
    else
    {
        printf("sleep\n");
        advertising_stop();
        random_pwr_fix();

        while(reset_flag)
        {
            nrf_pwr_mgmt_run();
        }
    }
#else
    advertising_stop();
    memset(m_beacon_info,0,sizeof(m_beacon_info));
    m_beacon_info[0] = 0xDE; //I
    m_beacon_info[1] = 0x1E; //T
    m_beacon_info[2] = rssiTH; //T

    m_beacon_info[3] = (uint8_t)(adcToBat(adcResult[3])*100);
    printf("RssiTH:%02X, BattV:%02X\n",m_beacon_info[2],m_beacon_info[3]);
    advertising_init();
    sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV,NULL,TX_POWER[txlevel]);
    advertising_start();
    random_pwr_fix();
    start_timer(battTime);

    while(!timerFlag)
    {
        nrf_pwr_mgmt_run();
    }

    stop_timer();
#endif
}

void setConfig(int setTime)
{
    millis_init = millis();
    printf("millis %d\n",millis_init);

    ud_init();
    start_timer(setTime);

    printf("power mgmt-> entring\n");
    while(!timerFlag || connected)
    {
        nrf_pwr_mgmt_run();
    }
    printf("power mgmt-> exiting\n");

    sd_ble_gap_adv_stop(m_advertising.adv_handle);
    nrf_delay_ms(1000);
    nrf_sdh_disable_request();
    nrf_delay_ms(1000);
    stop_timer();

    if(txlevel > 8)
    {
        txlevel = 7;
    }

    if((ble_channel < 0 || ble_channel > 100) && !lora_selected)
    {
        ble_channel = 17;
    }
      
    loratxlevel = (int8_t)power_map(txlevel, input_min, input_max, output_min, output_max);
    //lorafrequency = 900 + channel;
    lorafrequency = channel;
    bw_selection = lora_frequency_bandwidth;
    
    printf("OTA: %d\n",           OTA);
    printf("advTime: %d\n",       advTime);
    printf("short_advTime: %d\n",       short_advTime);
    printf("bletxlevel(d): %d\n", txlevel);
    printf("loratxlevel(d): %d\n", loratxlevel);
    printf("sleepTime: %d\n",     sleepTime);
    printf("scanDuration: %d\n",  scanDuration);
    printf("MODE: %d\n",          MODE);
    printf(DBG_BLUE "channel: %d\n" DBG_RESET, ble_channel);
    printf(DBG_GREEN "channel: %.2f\n" DBG_RESET, lorafrequency);
    printf("Radio: %d\n",         lora_selected);
    

    if(OTA)
    {
        NRF_POWER->GPREGRET = 0xB1;
        //sd_power_gpregret_set(0,0xB1);
        nrf_delay_ms(100);
        NVIC_SystemReset();
    }

//    if(lora_selected)
//    {
//        lora_radio_enable();
//    }
    ble_adv_stack_init();
}

#ifdef RESET
void mode_change(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    reset_flag = !reset_flag;
}

void mode_init()
{
    nrf_drv_gpiote_init();
    nrf_drv_gpiote_in_config_t mode_config;
    mode_config.sense = NRF_GPIOTE_POLARITY_HITOLO;
    mode_config.pull = NRF_GPIO_PIN_NOPULL;
    nrf_drv_gpiote_in_init(6, &mode_config, mode_change);
    nrf_drv_gpiote_in_event_enable(6, true);
}
#endif //RESET

