ananawaretrk/Opal_Fcc_nrf52810/fcc_jade_1/main.cpp
void config_init()
{
    nrf_drv_clock_init();
    nrf_drv_clock_lfclk_request(NULL);
    nrf_pwr_mgmt_init();
}

void get_ble_mac(void)
{
    uint8_t devId[6];
    //char idString[64];

    devId[0] = (NRF_FICR->DEVICEADDR[1] >> 8) | 0xC0;
    devId[1] = (NRF_FICR->DEVICEADDR[1] & 0xFF);
    devId[2] = ((NRF_FICR->DEVICEADDR[0] >> 24) & 0xFF);
    devId[3] = ((NRF_FICR->DEVICEADDR[0] >> 16) & 0xFF);
    devId[4] = ((NRF_FICR->DEVICEADDR[0] >> 8) & 0xFF);
    devId[5] = (NRF_FICR->DEVICEADDR[0] & 0xFF);
    sprintf(idString, "MAC = %02X:%02X:%02X:%02X:%02X:%02X", devId[0], devId[1], devId[2], devId[3], devId[4], devId[5]);
    printf("%s\n", idString);
}

void setVerBits(int V)
{
#ifdef SAS
    printf("Scan: %d\tAdv: %d\tSleep: %d\n",scanDuration,advTime,sleepTime);
#else
    printf("Scan: %d\tAdv: %d\n",scanDuration,sleepTime);
#endif //SAS

    switch(V)
    {
        case 0:
            clearBit(7);
            clearBit(6);
            break;
        case 1:
            clearBit(7);
            setBit(6);
            break;
        case 2:
            setBit(7);
            clearBit(6);
            break;
        case 3:
            setBit(7);
            setBit(6);
            break;
        default:
            clearBit(7);
            clearBit(6);
            break;
    }
}

void get_hw_ver(void)
{
    uint32_t info = NRF_FICR->INFO.VARIANT;
    uint8_t *p = (uint8_t *)&info;
    printf ("nRF%x Variant: %c%c%c%c\n",NRF_FICR->INFO.PART, p[3], p[2], p[1], p[0]);
    printf ("package: %x\n",NRF_FICR->INFO.PACKAGE);
    printf ("DevID: %x%x\n", NRF_FICR->DEVICEID[0],NRF_FICR->DEVICEID[1]);
}

#ifdef CUT
void cut_change(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    cut_flag = !cut_flag;
}

void cut_init()
{
    nrf_drv_gpiote_in_config_t cut_config;
    cut_config.sense = NRF_GPIOTE_POLARITY_HITOLO; //GPIOTE_CONFIG_IN_SENSE_LOTOHI(true);
    cut_config.pull = NRF_GPIO_PIN_NOPULL;
    nrf_drv_gpiote_in_init(13, &cut_config, cut_change);
    nrf_drv_gpiote_in_event_enable(13, true);
}
#endif //CUT

float my_rn()
{ 
  uint8_t num_rand_bytes_available;
  uint8_t old_units;
  uint8_t old_mantissa;
  uint8_t byte_old_radom_number;
  float f_old_random_number;
  
  // Generate random bytes
  int err = sd_rand_application_bytes_available_get(&num_rand_bytes_available);
  //uint8_t rand_number[2] = {0};
  if(num_rand_bytes_available > 0){
    sd_rand_application_vector_get(rand_number, 3);
  }
  
  // Compare and generate if duplicates
  if (rand_number[0] == old_units)
  {
      int err = sd_rand_application_bytes_available_get(&num_rand_bytes_available);
      if (num_rand_bytes_available > 0)
      {
          sd_rand_application_vector_get(&rand_number[0], 1);
      }
  }

  if (rand_number[1] == old_mantissa)
  {
      int err = sd_rand_application_bytes_available_get(&num_rand_bytes_available);
      if (num_rand_bytes_available > 0)
      {
          sd_rand_application_vector_get(&rand_number[1], 1);
      }
  }

  if (rand_number[2] == byte_old_radom_number)
  {
      int err = sd_rand_application_bytes_available_get(&num_rand_bytes_available);
      if (num_rand_bytes_available > 0)
      {
          sd_rand_application_vector_get(&rand_number[2], 2);
      }
  }
  
  // Range
  //rand_number[0] = rand_min + rand_number[0] % (rand_max - rand_min + 1);
  rand_number[0] = (rand_number[0] % 5);
  rand_number[1] = (rand_number[1] % 110);
  //rand_number[2] = (rand_number[2] % 32); // uncomment when using lora_fixed_frequency_hopping
  rand_number[2] = (rand_number[2] % 52); // uncomment when using lora_fixed1_frequency_hopping
 
  // Create floating number using two bytes
  f_random_number = rand_number[0] + (rand_number[1] * 0.01);
  
  // Generate floating number with a min difference of 0.25
  if (abs(f_old_random_number - f_random_number) < 0.25)
  {
      int err = sd_rand_application_bytes_available_get(&num_rand_bytes_available);
      if (num_rand_bytes_available > 0)
      {
          sd_rand_application_vector_get(rand_number, 2);
      }
      rand_number[0] = (rand_number[0] % 5);
      rand_number[1] = (rand_number[1] % 110);

      f_random_number = rand_number[0] + (rand_number[1] * 0.01);
  }

  //printf("My f_rn = %.2f\n", f_random_number);
  
  old_units = rand_number[0];
  old_mantissa = rand_number[1];
  byte_old_radom_number = rand_number[2];
  f_old_random_number = f_random_number;

  return f_random_number + 920;
}


uint8_t ble_random_frequency_generate()
{ 
  uint8_t num_rand_bytes_available;
  static uint8_t old_rand_number;
 
  int err = sd_rand_application_bytes_available_get(&num_rand_bytes_available);
  //uint8_t rand_number[2] = {0};
  if(num_rand_bytes_available > 0){
    sd_rand_application_vector_get(&rand_number[0], 2);
  }

  if (rand_number[0] == old_rand_number)
  {
      int err = sd_rand_application_bytes_available_get(&num_rand_bytes_available);
      if (num_rand_bytes_available > 0)
      {
          sd_rand_application_vector_get(&rand_number[0], 2);
      }
  }

  //rand_number[0] = rand_min + rand_number[0] % (rand_max - rand_min + 1);
  rand_number[0] = (rand_number[0] % 41) * 2;
  
  if(rand_number[0] == 0)
  {
    rand_number[0] = 2;
  }  
  //printf("My number = %d\n", rand_number[0]);
  
  old_rand_number = rand_number[0];
  
  return rand_number[0];
  
}

//LoRa

void lora_cw_transmit_5seconds()
{
  printf(DBG_GREEN "LoRa 5 second CW Transmit\n" DBG_RESET);
  
  // Modem config FSK
  rf95.sleep();
  rf95.spiWrite(RH_RF95_REG_01_OP_MODE, 0x00); // long range mode off 
  rf95.spiWrite( RH_RF95_REG_40_DIO_MAPPING1, 0x00 );
  rf95.spiWrite( RH_RF95_REG_41_DIO_MAPPING2, 0x30 );
  
  // Set Transmit Power
  rf95.setTxPower(loratxlevel);
  
  // Set FSK config
  //Setting FDEV to zero
  rf95.spiWrite( 0x04, ( uint8_t )0x00 ); // REG REG_FDEVMSB
  rf95.spiWrite( 0x05, ( uint8_t )0x00 ); // REG_FDEVLSB 
  
  // First write
  bool my_fixLen = false; // unlimited packet length (basically variable)
  bool my_crcOn = true;
  rf95.spiWrite( 0x30, //REG_PACKETCONFIG1
                         ( rf95.spiRead( 0x30 ) &
                           0xEF & //RF_PACKETCONFIG1_CRC_MASK
                           0X7F ) | // RF_PACKETCONFIG1_PACKETFORMAT_MASK
                           ( ( my_fixLen == 1 ) ? 0x00 : 0x80 ) |
                           ( my_crcOn << 4 ) );
                           
