ananawaretrk/Opal_Fcc_nrf52810/fcc_jade_1/main.cpp
void print_temperature_sensor_data()
{
    int temperature_fail_counter = 0;
    float temperature_array[5] = {0};

    i2c_wrapper.InitializeI2C();
    tmp_sensor.begin();
    for (int j = 0; j < 5; j++)
    {
        temperature_fail_counter = 0;
        tmp_sensor.setOneShotMode();
        while (tmp_sensor.dataReady() == false && temperature_fail_counter < 5)
        {
            nrf_delay_ms(110);
            temperature_fail_counter++;
        }
        temperature_array[j] = tmp_sensor.readTempC();
    }
    tmp_sensor.setShutdownMode();
    printf("----> Final TMP117 Temp = %3.2f %C\n", temperature_array[0]);
    i2c_wrapper.DeInitializeI2C();
}

long power_map(long x, long in_min, long in_max, long out_min, long out_max) {
  return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}

sm_state soc_init()
{
    ret_code_t err_code;
    
    err_code = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(err_code);

    config_init();
    get_ble_mac();
    get_hw_ver();
    init_timer();
    init_timer2();

    err_code = nrf_drv_rng_init(NULL);

    //ble_adv_stack_init();

    return STATE_BOARD_INIT;
}

sm_state board_init()
{
    init_spi_for_lora();

    //return STATE_GATT_SERVER;
    //return STATE_LORA_CONT_MCW_TX;
    return STATE_LORA_FIXED1_FREQUENCY_HOPPING;
    //return STATE_BLE_RANDOM_FREQUENCY_HOPPING;
    //return STATE_BLE_CONT_CW_TX;
    //return STATE_DEBUG;
    //return STATE_SLEEP;
    //return STATE_LORA_RANDOM_FREQUENCY_HOPPING;
    //return STATE_LORA_FIXED_FREQUENCY_HOPPING;
}

sm_state start_gatt_server()
{
    setConfig(120000);
    
    //STATE_BLE_CONT_CW_TX
    if(MODE == 2 && lora_selected == 0 && advTime == 0 && scanDuration == 0 && sleepTime == 0){
    return STATE_BLE_CONT_CW_TX;
    }

    else if(MODE == 0 && lora_selected == 0 && advTime == 0 && scanDuration == 0 && sleepTime == 0){
    return STATE_SLEEP;
    }
    
    //STATE_BLE_CONT_MCW_TX
    else if(MODE == 3 && lora_selected == 0 && advTime == 0 && scanDuration == 0 && sleepTime == 0){
    return STATE_BLE_CONT_MCW_TX;
    }

    //STATE_BLE_CONT_RX
    else if(MODE == 2 && lora_selected == 0 && advTime == 0 && scanDuration > 0 && sleepTime == 0){
    return STATE_BLE_CONT_RX;
    }

    //STATE_BLE_INT_CW_TX
    else if(MODE == 2 && lora_selected == 0 && advTime > 0 && scanDuration == 0 && sleepTime > 0){
    return STATE_BLE_INT_CW_TX;
    }
    
    //STATE_BLE_INT_MCW_TX
    else if(MODE == 3 && lora_selected == 0 && advTime > 0 && scanDuration == 0 && sleepTime > 0){
    return STATE_BLE_INT_MCW_TX;
    }

    //STATE_BLE_INT_RX
    else if(MODE == 2 && lora_selected == 0 && advTime == 0 && scanDuration > 0 && sleepTime > 0){
    return STATE_BLE_INT_RX;
    }

    //STATE_BLE_INT_CW_TX_RX
    else if(MODE == 2 && lora_selected == 0 && advTime > 0 && scanDuration > 0 && sleepTime > 0){
    return STATE_BLE_INT_CW_TX_RX;
    }

    //STATE_BLE_INT_MCW_TX_RX
    else if(MODE == 3 && lora_selected == 0 && advTime > 0 && scanDuration > 0 && sleepTime > 0){
    return STATE_BLE_INT_MCW_TX_RX;
    }
//--------------------------------------------------------------------------------------------------------------------------------
    //STATE_LORA_CONT_CW_TX
    else if(MODE == 2 && lora_selected == 1 && advTime == 0 && scanDuration == 0 && sleepTime == 0){
    return STATE_LORA_CONT_CW_TX;
    }

    //STATE_LORA_CONT_MCW_TX
    else if(MODE == 3 && lora_selected == 1 && advTime == 0 && scanDuration == 0 && sleepTime == 0){
    return STATE_LORA_CONT_MCW_TX;
    }

    //STATE_LORA_CONT_RX
    else if(MODE == 2 && lora_selected == 1 && advTime == 0 && scanDuration > 0 && sleepTime == 0){
    return STATE_LORA_CONT_RX;
    }

    //STATE_LORA_INT_CW_TX
    else if(MODE == 2 && lora_selected == 1 && advTime > 0 && scanDuration == 0 && sleepTime > 0){
    return STATE_LORA_INT_CW_TX;
    }

    //STATE_LORA_INT_MCW_TX
    else if(MODE == 3 && lora_selected == 1 && advTime > 0 && scanDuration == 0 && sleepTime > 0){
    return STATE_LORA_INT_MCW_TX;
    }

    //STATE_LORA_INT_RX
    else if(MODE == 2 && lora_selected == 1 && advTime == 0 && scanDuration > 0 && sleepTime > 0){
    return STATE_LORA_INT_RX;
    }
    
    //Default
    return STATE_SLEEP;
}

void sleep()
{
  while(1)
    {
       nrf_pwr_mgmt_run(); 
    }
}

void ble_radio_setup()
{   
    // Disable SD
    nrf_sdh_disable_request();

    // Configure HFCLK
    NRF_RNG->TASKS_START = 1;
    NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
    NRF_CLOCK->TASKS_HFCLKSTART        = 1;
    //while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0){ } // Do nothing.

    // Disable Radio
    NRF_RADIO->SHORTS = 0;
    NRF_RADIO->EVENTS_DISABLED = 0;
    NRF_RADIO->TASKS_TXEN = 0;
    NRF_RADIO->TASKS_STOP = 1;
    NRF_RADIO->TASKS_DISABLE = 1;
    NRF_RADIO->EVENTS_END = 1U;

    while (NRF_RADIO->EVENTS_DISABLED == 0){  }    // Do nothing.

    NRF_RADIO->EVENTS_DISABLED = 0;
}

sm_state ble_cont_cw_tx()
{
  // Configure BLE Radio
  ble_radio_setup();

  // Run CW 
  radio_config();

  return STATE_SLEEP;
}

sm_state ble_cont_mcw_tx()
{
  // Configure BLE Radio
  ble_radio_setup();
  
  //Run Modulated CW
  modulation();

  return STATE_SLEEP;
}

sm_state ble_cont_rx()
{
  // Scan and print
  bleScan(scanDuration);
  
  // Again come to same function
  return STATE_BLE_CONT_RX;
}

sm_state ble_int_cw_tx()
{
    // Setup BLE Radio
    ble_radio_setup();

    while (1)
    {
        // Run CW
        radio_config();

        // Advertise for x seconds
        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        // Stop CW
        radio_disable();

        // Do not advertise for x seconds
        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();
    }

    return STATE_SLEEP;
}

sm_state ble_int_mcw_tx()
{
    // Setup BLE Radio
    ble_radio_setup();

    while (1)
    {
        // Run MCW
        modulation();

        // Advertise for x seconds
        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        // Stop MCW
        radio_disable();

        // Do not advertise for x seconds
        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();
    }

    return STATE_SLEEP;
}

