ananawaretrk/Opal_Fcc_nrf52810/fcc_jade_1/main.cpp
sm_state ble_int_rx()
{
    // Setup BLE Radio
    ble_radio_setup();

    while (1)
    {
        // Run scan for x seconds
        bleScan(scanDuration);

        // Do not scan and sleep for x seconds
        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();
    }

    return STATE_SLEEP;
}

sm_state ble_int_cw_tx_rx()
{
    // Setup BLE Radio
    ble_radio_setup();

    while (1)
    {
        // Run CW
        radio_config();

        // Advertise for x seconds
        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        // Stop CW
        radio_disable();

        // Do not advertise for x seconds
        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        // Run scan for x seconds
        bleScan(scanDuration);
    }

    return STATE_SLEEP;
}

sm_state ble_int_mcw_tx_rx()
{
    // Setup BLE Radio
    ble_radio_setup();

    while (1)
    {
        // Run CW
        modulation();

        // Advertise for x seconds
        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        // Stop CW
        radio_disable();

        // Do not advertise for x seconds
        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();

        // Run scan for x seconds
        bleScan(scanDuration);
    }

    return STATE_SLEEP;
}

sm_state lora_cont_cw_tx()
{
    // Init LoRa
    printf(DBG_GREEN "LoRa Radio Continuous Transmit\n" DBG_RESET);
    loraInit();
    nrf_delay_ms(1000);
    
    // LoRa CW
    lora_continuous_cw_transmit();

    return STATE_SLEEP;
}

sm_state lora_cont_mcw_tx()
{
    // Init LoRa
    printf(DBG_GREEN "LoRa Radio MCW Transmit\n" DBG_RESET);
    loraInit();
    nrf_delay_ms(1000);
    
    lora_continuous_transmit(true);
    //lora_continuous_transmit(false);

    return STATE_SLEEP;
}

sm_state lora_cont_rx()
{
    // Init LoRa
    printf(DBG_GREEN "LoRa Radio Continous Transmit\n" DBG_RESET);
    loraInit();
    nrf_delay_ms(1000);

    lora_continuous_receive();

    return STATE_SLEEP;
}

sm_state lora_int_rx()
{
    // Init LoRa
    printf(DBG_GREEN "LoRa Radio Interval Receive\n" DBG_RESET);
    loraInit();
    nrf_delay_ms(1000);
    
    while(1)
    {
        lora_interval_receive(scanDuration);
    }

    return STATE_SLEEP;
}

sm_state lora_int_cw_tx()
{
    // Init LoRa
    loraInit();
    nrf_delay_ms(1000);

    while (1)
    {
        printf(DBG_GREEN "LoRa Radio CW Transmit\n" DBG_RESET);
        lora_continuous_cw_transmit();

        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();
        
        printf(DBG_GREEN "LoRa Radio stop\n" DBG_RESET);
        lora_disable();

        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();
    }

    return STATE_SLEEP;
}

sm_state lora_int_mcw_tx()
{
    // Init LoRa
    loraInit();
    nrf_delay_ms(1000);

    while (1)
    {
        printf(DBG_GREEN "LoRa Radio MCW Transmit\n" DBG_RESET);
        lora_continuous_transmit(false);

        start_timer(advTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();
        
        printf(DBG_GREEN "LoRa Radio stop\n" DBG_RESET);
        lora_disable();

        start_timer(sleepTime);
        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }
        stop_timer();
    }
    
    return STATE_SLEEP;
}

sm_state lora_random_frequency_hopping()
{
    // Hopping code here
    loratxlevel = 20;
    loraInit();
    rf95.setFrequency(922.5);
    lora_continuous_cw_transmit();

    while (1)
    {
        rf95.setFrequency(my_rn());
        lora_continuous_cw_transmit();
        start_timer(200);

        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }

        stop_timer();
        lora_disable();
    }


    return STATE_SLEEP;
}

sm_state lora_fixed_frequency_hopping()
{
    // Hopping code here

    // Create array of the fixed frequency
    lora_frequency_set[0] = 917.1;
    for(int i=0; i<32; i++)
    {
      lora_frequency_set[i+1] = lora_frequency_set[i] + 0.2;
    }
    for(int i=0; i<32; i++)
    {
        printf("lora_frequency_set[%d] = %.1f\n", i, lora_frequency_set[i]);
        nrf_delay_ms(10);
        //printf("lora_frequency_set[0] = %.1f, lora_frequency_set[32] = %.1f\n", lora_frequency_set[0], lora_frequency_set[32]);
    }

    loratxlevel = 20;
    bw_selection = 1;
    loraInit();
    rf95.setFrequency(lora_frequency_set[0]);
    lora_continuous_cw_transmit();

    while (1)
    {
        my_rn();
        rf95.setFrequency(lora_frequency_set[rand_number[2]]);
        lora_continuous_cw_transmit();
        start_timer(200);

        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }

        stop_timer();
        lora_disable();
    }


    return STATE_SLEEP;
}

sm_state lora_fixed1_frequency_hopping()
{
    // Hopping code here
    printf(DBG_GREEN "lora_fixed1_frequency_hoppin\n" DBG_RESET);
    // Create array of the fixed frequency
    lora_frequency_set1[0] = 902.5;
    for(int i=0; i<51; i++)
    {
      lora_frequency_set1[i+1] = lora_frequency_set1[i] + 0.5;
    }
    for(int i=0; i<51; i++)
    {
        printf("lora_frequency_set1[%d] = %.1f\n", i, lora_frequency_set1[i]);
        nrf_delay_ms(10);
        //printf("lora_frequency_set1[0] = %.1f, lora_frequency_set1[32] = %.1f\n", lora_frequency_set1[0], lora_frequency_set1[32]);
    }

    loratxlevel = 20;
    bw_selection = 1;
    loraInit();
//    rf95.setFrequency(919.5);
//    lora_continuous_transmit(false);
//    lora_disable();
   

    while (1)
    {
        //my_rn();
        //rf95.setFrequency(lora_frequency_set1[rand_number[2]]);
        rf95.setFrequency(lora_frequency_set1[rng_num1()]);
        lora_continuous_transmit(false);
        start_timer(50);

        while (!timerFlag)
        {
            nrf_pwr_mgmt_run();
        }

        stop_timer();
        lora_disable();
    }


    return STATE_SLEEP;
}

sm_state debug_function()
{
    // Debug Function here

    printf(DBG_MAGENTA "LoRa Radio stop\n" DBG_RESET);

    state = STATE_SOC_INIT;

    //init_spi_for_lora();
    
    loratxlevel = 20;

