ananawaretrk/Opal_Fcc_nrf52810/fcc_jade_1/main.cpp
    loraInit();
    
    rf95.setFrequency(916);

//    while(1){
//    lora_interval_transmit(5000); 
//    }

    if (1)
    {
        lora_continuous_transmit(true);
    }

    if (1)
    {
        lora_continuous_receive();
    }

    //int my_rcv_time = 10000;
    
    //lora_interval_receive(my_rcv_time);
    
    //lora_cw_transmit_5seconds();
    
    //lora_continuous_cw_transmit();
    
    //lora_continuous_transmit(true);
    
    //nrf_delay_ms(5000);
    
    //lora_disable();
  
    //while(1);

    return STATE_SLEEP;
}

static uint8_t rng_num()
{
   uint32_t err_code;
   
   uint8_t available;
   
   nrf_drv_rng_bytes_available(&available);
   while(available = 0){printf("Didnt get random number\n");}

   err_code = nrf_drv_rng_rand(&random_byte, 1);
    //APP_ERROR_CHECK(err_code);

   if (random_byte == old_random_byte)
   {
       nrf_drv_rng_bytes_available(&available);
       while (available = 0)
       {
           printf("Didnt get random number\n");
       }
       err_code = nrf_drv_rng_rand(&random_byte, 1);
   }

   old_random_byte = random_byte;

   random_byte = (random_byte % 41) * 2;
  
  if(random_byte == 0)
  {
    random_byte = 2;
  }

    return random_byte;
}

static uint8_t rng_num1()
{
   uint32_t err_code;
   
   uint8_t available;
   
   nrf_drv_rng_bytes_available(&available);
   while(available = 0){printf("Didnt get random number\n");}

   err_code = nrf_drv_rng_rand(&random_byte, 1);
    //APP_ERROR_CHECK(err_code);

   if (random_byte == old_random_byte)
   {
       nrf_drv_rng_bytes_available(&available);
       while (available = 0)
       {
           printf("Didnt get random number\n");
       }
       err_code = nrf_drv_rng_rand(&random_byte, 1);
   }

   old_random_byte = random_byte;

   random_byte = (random_byte % 52);
  
//  if(random_byte == 0)
//  {
//    random_byte = 2;
//  }

    return random_byte;
}

void print_rn()
{
      while (1)
    {      
        ble_channel = ble_random_frequency_generate();
        printf(DBG_BLUE "ble channel: %d\n" DBG_RESET, ble_channel);
        nrf_delay_ms(250);
        //radio_function();
    }
}

sm_state ble_random_frequency_hopping()
{
    
    // Set adv params
    advTime = 350;
    txlevel = 7;

    nrf_delay_ms(500);
    ble_adv_stack_init();
    nrf_delay_ms(500);

    //ble_radio_setup();
    nrf_sdh_disable_request();
    // Configure HFCLK
    NRF_RNG->TASKS_START = 1;
    NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
    NRF_CLOCK->TASKS_HFCLKSTART        = 1;
    //while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0){ } // Do nothing.

//    // Required to enable sdh for rng
//    nrf_delay_ms(500);
//    ble_adv_stack_init();
//    nrf_delay_ms(500);

    //print_rn();

    printf(DBG_BLUE "ble txlevel(d): %d\n" DBG_RESET, txlevel);
    printf(DBG_BLUE "ble channel: %d\n" DBG_RESET, ble_channel);

    while (1)
    {
        ble_channel = rng_num();
        printf(DBG_BLUE "ble channel: %d\n" DBG_RESET, ble_channel);
        radio_disable();
        modulation();
        nrf_delay_ms(advTime);
        radio_disable();
    }
    return STATE_SLEEP;
}



int main(void)
{
    ret_code_t err_code;

    state = STATE_SOC_INIT;
    while (1)
    {
        switch (state)
        {
            case STATE_SOC_INIT:
                printf("STATE_SOC_INIT\n");
                state = soc_init();
                break;

            case STATE_BOARD_INIT:
                printf("STATE_BOARD_INIT\n");
                state = board_init();
                break;

            case STATE_GATT_SERVER:
                printf("STATE_GATT_SERVER\n");
                state = start_gatt_server();
                break;

            case STATE_SLEEP:
                printf("STATE_SLEEP\n");
                sleep();
                break;

            case STATE_BLE_CONT_CW_TX:
                printf("STATE_BLE_CONT_CW_TX\n");
                state = ble_cont_cw_tx();
                break;

            case STATE_BLE_CONT_MCW_TX:
                printf("STATE_BLE_CONT_MCW_TX\n");
                state = ble_cont_mcw_tx();
                break;

            case STATE_BLE_CONT_RX:
                printf("STATE_BLE_CONT_RX\n");
                state = ble_cont_rx();
                break;

            case STATE_BLE_INT_CW_TX:
                printf("STATE_BLE_INT_CW_TX\n");
                state = ble_int_cw_tx();
                break;

            case STATE_BLE_INT_MCW_TX:
                printf("STATE_BLE_INT_MCW_TX\n");
                state = ble_int_mcw_tx();
                break;

            case STATE_BLE_INT_RX:
                printf("STATE_BLE_INT_RX\n");
                state = ble_int_rx();
                break;

            case STATE_BLE_INT_CW_TX_RX:
                printf("STATE_BLE_INT_CW_TX_RX\n");
                state = ble_int_cw_tx_rx();
                break;

            case STATE_BLE_INT_MCW_TX_RX:
                printf("STATE_BLE_INT_MCW_TX_RX\n");
                state = ble_int_mcw_tx_rx();
                break;

            case STATE_LORA_CONT_CW_TX:
                printf("STATE_LORA_CONT_CW_TX\n");
                state = lora_cont_cw_tx();
                break;

            case STATE_LORA_CONT_MCW_TX:
                printf("STATE_LORA_CONT_MCW_TX\n");
                state = lora_cont_mcw_tx();
                break;

            case STATE_LORA_CONT_RX:
                printf("STATE_LORA_CONT_RX\n");
                state = lora_cont_rx();
                break;

            case STATE_LORA_INT_RX:
                printf("STATE_LORA_INT_RX\n");
                state = lora_int_rx();
                break;

            case STATE_LORA_INT_CW_TX:
                printf("STATE_LORA_INT_CW_TX\n");
                state = lora_int_cw_tx();
                break;

            case STATE_LORA_INT_MCW_TX:
                printf("STATE_LORA_INT_MCW_TX\n");
                state = lora_int_mcw_tx();
                break;

            case STATE_LORA_RANDOM_FREQUENCY_HOPPING:
                printf("STATE_LORA_RANDOM_FREQUENCY_HOPPING\n");
                state = lora_random_frequency_hopping();
                break;

            case STATE_LORA_FIXED_FREQUENCY_HOPPING:
                printf("STATE_LORA_FIXED_FREQUENCY_HOPPING\n");
                state = lora_fixed_frequency_hopping();
                break;

            case STATE_LORA_FIXED1_FREQUENCY_HOPPING:
                printf("STATE_LORA_FIXED1_FREQUENCY_HOPPING\n");
                state = lora_fixed1_frequency_hopping();
                break;

            case STATE_BLE_RANDOM_FREQUENCY_HOPPING:
                printf("STATE_BLE_RANDOM_FREQUENCY_HOPPING\n");
                state = ble_random_frequency_hopping();
                break;

            case STATE_DEBUG:
                printf("STATE_DEBUG\n");
                state = debug_function();
                break;

            default:
                printf("DEFAULT: STATE_SLEEP\n");
                sleep();
                break;
        }
    }
}

