ananawaretrk/Opal_Fcc_nrf52810/fcc_jade_1/main.cpp
/*
Battery Level, 50% battery voltage on pin PO_29/AIN5
4.3V-2.75V/2 = 2.15V-1.355V/6 = 0.358-0.22V     1024=0.6V, 0=0V
*/
int checkBit(int n)
{
    return ((TapeLog[1].scanLog[0].counter >> n) & 1);
}
void clearBit(int n)
{
    if(checkBit(n) == 1)
    {
        TapeLog[1].scanLog[0].counter &= ~(1 << n);
        TapeLog[0].scanLog[n].millisTime = (millis() - millis_init)/1000;
    }
    TapeLog[0].scanLog[n].counter = 0;
}

void setBit(int n)
{
    if(checkBit(n) == 0)
    {
        TapeLog[1].scanLog[0].counter |= 1 << n;
        TapeLog[0].scanLog[n].millisTime = (millis() - millis_init)/1000;
    }
    TapeLog[0].scanLog[n].counter = 0;
}

void wdt_init(int seconds)
{
    NRF_WDT->CONFIG = (WDT_CONFIG_HALT_Pause << WDT_CONFIG_HALT_Pos) | (WDT_CONFIG_SLEEP_Run << WDT_CONFIG_SLEEP_Pos); //Configure Watchdog. a) Pause watchdog while the CPU is halted by the debugger.    b) Keep the watchdog running while the CPU is sleeping.
    NRF_WDT->CRV = seconds * 32768;                                                                                                                                                                        //ca 3 sek. timout
    NRF_WDT->RREN |= WDT_RREN_RR0_Msk;                                                                                                                                                                 //Enable reload register 0

    // Enable WDT interrupt:
    NVIC_EnableIRQ(WDT_IRQn);
    NRF_WDT->INTENSET = WDT_INTENSET_TIMEOUT_Msk;

    NRF_WDT->TASKS_START = 1; //Start the Watchdog timer
}

void wdt_reset()
{
    NRF_WDT->RR[0] = WDT_RR_RR_Reload;
}

bool checkZeros(void)
{
    for(int i=1;i<=(data_len-11);i++)
    {
        if(adv_data[adv_len-i] != 0)
        {
            return false;
        }
    }
    return true;
}

void zeroTags(int tagy)
{
    records = 0;
    millis_init = 0;
    memset(m_beacon_info,0,sizeof(m_beacon_info));
    TapeLog[1].scanLog[0].millisTime = 0;
    TapeLog[1].scanLog[0].counter = 0;
    clearFlag = true;

    for (int k = 0; k < NUMBER_OF_TAGS; k++)
    {
        TapeLog[tagy].scanLog[k].subID = 0;
        TapeLog[tagy].scanLog[k].tempRec = 0;
        TapeLog[tagy].scanLog[k].Lorarssi = 0;
        TapeLog[tagy].scanLog[k].subBat = 0;
        TapeLog[tagy].scanLog[k].millisTime = 0;
        TapeLog[tagy].scanLog[k].counter = 0;
        memset(TapeLog[tagy].scanLog[k].addr, 0, MAX_ID_BUF_LENGTH);

        TapeLog[tagy].glat = -1;
        TapeLog[tagy].glon = -1;
        TapeLog[tagy].logNo = 0;
        TapeLog[tagy].relayBat = 0;
        memset(TapeLog[tagy].relayId, 0, MAX_ID_BUF_LENGTH);
    }
}

int checkIdInLog(uint8_t inArray[], int testlog)
{
    for (int k = 0; k < NUMBER_OF_TAGS; k++)
    {
        if (compareArrays(inArray, TapeLog[testlog].scanLog[k].addr, 6))
        {
            return k;
        }
    }
    return -1;
}

int compareArrays(uint8_t a[], uint8_t b[], int n)
{
    for (int ii = 0; ii < n; ii++)
    {
        if (a[ii] != b[ii])
        {
            return 0;
        }
    }

    return 1;
}

void scan_stop(void)
{
    sd_ble_gap_scan_stop();
}


//This supports 10 timers, we currently use just 1 called timer_id
//It uses rtc1, so watch out for making collisions by using rtc1 for something else
void init_timer(void)
{
    app_timer_init();
}


uint32_t read_timer(void)
{
    return app_timer_cnt_get();
}

void stop_timer()
{
#ifdef TEST
    //printf("Stopping Timer\n");
#endif
    app_timer_stop(timer_id);
    timerFlag = 0;
}

void bleAdv(int timeOutMillis)
{

#ifdef TEST
    printf("BLE Adv Start\n");
#endif //TEST

    ble_adv_init();
    start_timer(timeOutMillis);
    while (!timerFlag)
    {
        nrf_pwr_mgmt_run(); //nrf_delay
    }
    advertising_stop();
    nrf_sdh_disable_request();
    stop_timer();

#ifdef TEST
    printf("BLE Adv Stop\n");
#endif //TEST

    nrf_delay_ms(50);
}

void wakeFromSleep()
{
    sleepflag = 0;
    wdt_reset();
    nrf_delay_ms(100);
    stop_timer();
#ifdef TEST
    printf("Woke up\n");
#endif //TEST
}

void goToSleep()
{
    sendFlag = false;
    timeoutFlagb = 0;
    sleepflag = 1;
}

uint8_t *hex_decode(char *in, size_t len, uint8_t *out)
{
    unsigned int i, t, hn, ln;

    for (t = 0, i = 0; i < len; i += 2, ++t)
    {
        hn = in[i] > '9' ? (in[i] | 32) - 'a' + 10 : in[i] - '0';
        ln = in[i + 1] > '9' ? (in[i + 1] | 32) - 'a' + 10 : in[i + 1] - '0';

        out[t] = (hn << 4) | ln;
    }
    return out;
}

void bleScan(int timeOutMillis)
{
#ifdef TEST
    printf("BLE Scan Start %d\n",timeOutMillis);
#endif //TEST
    BLE_GW = false;
    Drop_Flag = false;
    B_gps = false;
    B_gps = false;
    B_lora = false;
    B_cell = false;
    //records = 0;
    oxy_scanned = false;
    ble_scanner_init();
    start_timer(timeOutMillis);
    while (!timerFlag && (records < NUMBER_OF_TAGS))
        nrf_pwr_mgmt_run();
    scan_stop();
    stop_timer();
    nrf_sdh_disable_request();

#ifdef TEST
    printf("BLE Scan Stop\n");
#endif //TEST
}

void random_pwr_fix()
{
}

void spi_event_handler(nrf_drv_spi_evt_t const *p_event, void *p_context)
{
    spi_xfer_done = true;
}

void lora_radio_enable(void)
{
    nrf_gpio_cfg_output(LORA_RST);
    nrf_gpio_cfg_input(LORA_INT, NRF_GPIO_PIN_NOPULL);
    nrf_gpio_pin_clear(LORA_RST);
    nrf_delay_ms(1);

    nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
    spi_config.ss_pin = LORA_NSS;
    spi_config.miso_pin = SPI_MISO_PIN;
    spi_config.mosi_pin = SPI_MOSI_PIN;
    spi_config.sck_pin = SPI_SCK_PIN;
    spi_config.frequency = NRF_DRV_SPI_FREQ_2M;
    spi_config.bit_order = NRF_DRV_SPI_BIT_ORDER_MSB_FIRST;
    APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler, NULL));

    // Set up interrupt
    //nrfx_gpiote_in_config_t pin_config = NRFX_GPIOTE_CONFIG_IN_SENSE_LOTOHI(true);

    //ret_code_t result = nrfx_gpiote_in_init(LORA_RST, &pin_config, gpiote_lora_evt_handler);

//    if(result != NRFX_SUCCESS)
//    {
//        printf("gpiote init failed for Lora SPI\n");
//    }
    nrfx_gpiote_in_event_enable(LORA_RST, true);

    if (!rf95.init(&spi, LORA_INT, 1))
    {
        printf("LoRa radio init failed\n");
    }
    else
    {
        printf("LoRa radio init success\n");
    }
}

void lora_radio_configure(void)
{
    uint8_t error_code[] = {0x01};
    sx126x.spiWriteAddr(0x0889, error_code, 1);

    if(channel < 1 || channel > 29)
    {
        channel = 15;
    }

    lora_frequency = 900 + channel;

    sx126x.setFrequency(lora_frequency);
    nrf_delay_ms(1);

    sx126x.setTxPower(lora_power, true);
    nrf_delay_ms(1);

    printf("freq: %d\n", (uint32_t)(lora_frequency * 1000 * 1000));
    printf("pwr: %d\n", lora_power);
}

void lora_radio_cw_mode_w_data(void)
{
    while(1)
    {
        sx126x.send((uint8_t *)"Hello World, This is Lora Modulated Carrier Wave\n\r", 50);
        nrf_delay_ms(10);
    }
}

void lora_radio_cw_rx_mode(void)
{
    uint8_t buffer[MAX_PAYLOAD_LEN];
    while(1)
    {
        sx126x.recv(buffer, MAX_PAYLOAD_LEN);
        nrf_delay_ms(10);
    }
}

void lora_radio_cw_mode(void)
{
    sx126x.setTxContinuousWave();
}

void lora_radio_disable(void)
{
    sx126x.setModeIdle();
}

void gpiote_lora_evt_handler(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    #ifdef test_print
    printf("Lora DIO0 interrupt, RxDone or TxDone\n");
    #endif //test_print

    switch (action)
    {
        case NRF_GPIOTE_POLARITY_LOTOHI:
           // sx126x.handleInterrupt();
           rf95.handleInterrupt();
        break;

        default:
            break;
    }
}